<?php header("Content-Type: text/html; charset=utf-8");

/* 
23. Напишите 3 строки, используя три разные функции для вывода текста.
 */

echo "Напишите 3 строки, используя три разные функции для вывода текста.<br>";
print "Напишите 3 строки, используя три разные функции для вывода текста.<br>";
//printf("Напишите 3 строки, используя три разные функции для вывода текста.<br>");
var_dump("Напишите 3 строки, используя три разные функции для вывода текста.");

?>
<br>
<a href="index.php">General</a>